spec/cassettes/StripeWrapper/StripeWrapper_Customer/_create/with_a_valid_card/creates_a_customer.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/customers
    body:
      encoding: UTF-8
      string: email=deion%40hills.co&card=tok_visa
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/3.9.0
      Authorization:
      - Bearer sk_test_yGFEJfYxnx1GBParGqjGM8RE
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"3.9.0","lang":"ruby","lang_version":"2.4.1 p111 (2017-03-22)","platform":"x86_64-darwin16","engine":"ruby","publisher":"stripe","uname":"Darwin
        Durrells-MacBook-Pro.local 16.7.0 Darwin Kernel Version 16.7.0: Thu Jun 15
        17:36:27 PDT 2017; root:xnu-3789.70.16~2/RELEASE_X86_64 x86_64","hostname":"Durrells-MacBook-Pro.local"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sat, 09 Dec 2017 23:14:09 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1389'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - X-Stripe-Privileged-Session-Required,stripe-manage-version,X-Stripe-External-Auth-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_hZWR4run0kED2O
      Stripe-Version:
      - '2017-04-06'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "id": "cus_Bv7lXtaQFh5kbl",
          "object": "customer",
          "account_balance": 0,
          "created": 1512861248,
          "currency": null,
          "default_source": "card_1BXHWGGXpxGLtyRZ1HdR8ZQ4",
          "delinquent": false,
          "description": null,
          "discount": null,
          "email": "deion@hills.co",
          "livemode": false,
          "metadata": {},
          "shipping": null,
          "sources": {
            "object": "list",
            "data": [
              {
                "id": "card_1BXHWGGXpxGLtyRZ1HdR8ZQ4",
                "object": "card",
                "address_city": null,
                "address_country": null,
                "address_line1": null,
                "address_line1_check": null,
                "address_line2": null,
                "address_state": null,
                "address_zip": null,
                "address_zip_check": null,
                "brand": "Visa",
                "country": "US",
                "customer": "cus_Bv7lXtaQFh5kbl",
                "cvc_check": null,
                "dynamic_last4": null,
                "exp_month": 8,
                "exp_year": 2019,
                "fingerprint": "lDX58NyMrxeFQZLt",
                "funding": "credit",
                "last4": "4242",
                "metadata": {},
                "name": null,
                "tokenization_method": null
              }
            ],
            "has_more": false,
            "total_count": 1,
            "url": "/v1/customers/cus_Bv7lXtaQFh5kbl/sources"
          },
          "subscriptions": {
            "object": "list",
            "data": [],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_Bv7lXtaQFh5kbl/subscriptions"
          }
        }
    http_version: 
  recorded_at: Sat, 09 Dec 2017 23:14:09 GMT
recorded_with: VCR 4.0.0
